# Pandas

## Pandera
- This package is used to define static types for pandas
- series can be made with list, tuple and dictionary

In [82]:
# Pandas Series
import pandas as pd
import pandera as pa

s1 : pd.Series = pd.Series([10, 20, 30, 40, 50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Pandas core components
- Series types
- Dataframe types

In [85]:
s1 : pd.Series = pd.Series({
    "a" : 1,
    "b" : 2,
    "c" : 3,
    "d" : 4,
    "e" : 5
})
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
values : list[int] = [1, 2, 3, 4, 5]
keys : list[str] = ["a", "b", "c", "d", "e"]

s1 : pd.Series = pd.Series(values, index=keys)
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
# multi index series
# name can also be given to series

import numpy as np
values : list[int] = [1, 2, 3, 4, 5]
keys : list[list[str]] = [["a1", "a1", "a1", "b1", "a1"], ["a", "b", "c", "d", "e"]]

s1 : pd.Series = pd.Series(
    values, 
    index=keys, 
    name="my_data",
    dtype=np.int32
    )
s1

a1  a    1
    b    2
    c    3
b1  d    4
a1  e    5
Name: my_data, dtype: int32

## Static type validation with pandera

In [15]:
# data to validate
df = pd.DataFrame({
    "column1": [1, 4, 0, 10, 9],
    "column2": [-1.3, -1.4, -2.9, -10.1, -20.4],
    "column3": ["value_1", "value_2", "value_3", "value_2", "value_1"],
})

# define schema
schema = pa.DataFrameSchema({
    "column1": pa.Column(int, checks=pa.Check.le(10)),
    "column2": pa.Column(float, checks=pa.Check.lt(-1.2)),
    "column3": pa.Column(str, checks=[
        pa.Check.str_startswith("value_"),
        # define custom checks as functions that take a series as input and
        # outputs a boolean or boolean Series
        pa.Check(lambda s: s.str.split("_", expand=True).shape[1] == 2)
    ]),
})

validated_df = schema(df)
print(validated_df)

   column1  column2  column3
0        1     -1.3  value_1
1        4     -1.4  value_2
2        0     -2.9  value_3
3       10    -10.1  value_2
4        9    -20.4  value_1

In [21]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name='ID')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name='Marks')
s3 : pd.Series = pd.Series(['wasim', 'ali', 'usman', 'qasim', 'nasir'], name='Name')

data : pd.DataFrame = pd.concat([s1, s2, s3], axis=1)
data

   ID  Marks   Name
0   1     10  wasim
1   2     20    ali
2   3     30  usman
3   4     40  qasim
4   5     50  nasir

In [22]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name='ID')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name='Marks')
s3 : pd.Series = pd.Series(['wasim', 'ali', 'usman', 'qasim', 'nasir'], name='Name')

data : pd.DataFrame = pd.DataFrame({
    s1.name : s1,
    s2.name : s2,
    s3.name : s3
})
data

   ID  Marks   Name
0   1     10  wasim
1   2     20    ali
2   3     30  usman
3   4     40  qasim
4   5     50  nasir

In [24]:
s1 : pd.Series = pd.Series([1, 2, 3, 4, 5], name='ID')
s2 : pd.Series = pd.Series([10, 20, 30, 40, 50], name='Marks')
s3 : pd.Series = pd.Series(['wasim', 'ali', 'usman', 'qasim', 'nasir'], name='Name')

data : pd.DataFrame = pd.DataFrame([s1, s2, s3])
data

           0    1      2      3      4
ID         1    2      3      4      5
Marks     10   20     30     40     50
Name   wasim  ali  usman  qasim  nasir

In [32]:
data : list[list[int]] = [[1, 2, 3], 
                          [4, 5, 6], 
                          [7, 8, 9]]

result : pd.DataFrame = pd.DataFrame(data, columns=['A', 'B', 'C'], index=['X', 'Y', 'Z'])
result

   A  B  C
X  1  2  3
Y  4  5  6
Z  7  8  9

In [28]:
result.columns

Index(['A', 'B', 'C'], dtype='object')

In [29]:
result.index

Index(['X', 'Y', 'Z'], dtype='object')

In [30]:
result.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [86]:
from nptyping import NDArray, Shape, Int64

s1 : NDArray[Shape["Size, Size"], Int64] = np.arange(10*10).reshape(10,10)
s1

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [36]:
df : pd.DataFrame = pd.DataFrame(s1, columns=list("ABCDEFGHIJ"))
df

    A   B   C   D   E   F   G   H   I   J
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [39]:
df : list[pd.DataFrame] = pd.read_html('https://www.w3schools.com/python/python_operators.asp')
df[0]

  Operator            Name Example    Try it
0        +        Addition   x + y  Try it »
1        -     Subtraction   x - y  Try it »
2        *  Multiplication   x * y  Try it »
3        /        Division   x / y  Try it »
4        %         Modulus   x % y  Try it »
5       **  Exponentiation  x ** y  Try it »
6       //  Floor division  x // y  Try it »

In [41]:
df : pd.DataFrame = pd.read_json('https://www.w3schools.com/python/pandas/data.js')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.4
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

## Slicing and indexing
- ```iat``` and ```at``` are mainly used for indexing
- ```iloc``` and ```loc``` are mainly used for slicing
    - The main advantage is that you can also update the values

In [44]:
s1 : pd.Series = pd.Series([10, 20, 30, 40, 50])
s1[1:3]

1    20
2    30
dtype: int64

In [50]:
s1 : pd.Series = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
s1

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [51]:
# behaves like normal slicing
s1 : pd.Series = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
s1.iloc[1:3]

b    20
c    30
dtype: int64

In [53]:
# loc works on keys and also includes ending
s1 : pd.Series = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
s1.loc["a":"b"]

a    10
b    20
dtype: int64

## Regex

In [87]:
import re

data : str = '''09:30:15 From Sara to Everyone: PIAIC-1234567
14:05:33 From Bilal to Everyone: PIAIC-8765432
16:22:10 From Ayesha to Everyone: PIAIC3456789
18:45:50 From Usman to Everyone: PIAIC 5678901
20:10:25 From Fatima to Everyone: PIAIC-9876543
'''

pattern : str = r'(\d{2}:\d{2}:\d{2}) From (.*) to Everyone: (PIAIC-? ?)(\d{5,6})'

result = re.findall(pattern, data)
result

[('09:30:15', 'Sara', 'PIAIC-', '123456'),
 ('14:05:33', 'Bilal', 'PIAIC-', '876543'),
 ('16:22:10', 'Ayesha', 'PIAIC', '345678'),
 ('18:45:50', 'Usman', 'PIAIC ', '567890'),
 ('20:10:25', 'Fatima', 'PIAIC-', '987654')]

In [80]:
df : pd.DataFrame = pd.DataFrame(result, columns=["DateTime", "Name", "Dept.", "Roll Number"])
df

   DateTime    Name   Dept. Roll Number
0  09:30:15    Sara  PIAIC-      123456
1  14:05:33   Bilal  PIAIC-      876543
2  16:22:10  Ayesha  PIAIC-      345678
3  18:45:50   Usman  PIAIC-      567890
4  20:10:25  Fatima  PIAIC-      987654

## Class 18

### Dataframe
- Add Column
- Delete Column
- Update Column
- map
- apply
- concat
    - axis = 0 top to bottom
    - axis = 1 left to right

In [98]:
from nptyping import Shape, Int64
from typing import List
total : int = 10000

s1 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(80, 100, total)
ss1 : pd.Series = pd.Series(s1)

s2 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(70, 79, total)
ss2 : pd.Series = pd.Series(s2)

s3 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(60, 69, total)
ss3 : pd.Series = pd.Series(s3)

s4 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(50, 59, total)
ss4 : pd.Series = pd.Series(s4)

s5 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(40, 49, total)
ss5 : pd.Series = pd.Series(s5)

s6 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(33, 39, total)
ss6 : pd.Series = pd.Series(s6)

s7 : NDArray[Shape[f"{total}"], Int64] = np.random.randint(0, 32, total)
ss7 : pd.Series = pd.Series(s7)

ss7

0       28
1       30
2       20
3       26
4       30
        ..
9995    12
9996    23
9997     4
9998    24
9999     6
Length: 10000, dtype: int64

In [104]:
s1 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(80, 100, (total, 5))
ss1 : pd.DataFrame = pd.DataFrame(s1, columns=["s1", "s2", "s3", "s4", "s5"])

s2 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(70, 79, (total, 5))
ss2 : pd.DataFrame = pd.DataFrame(s2, columns=["s1", "s2", "s3", "s4", "s5"])

s3 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(60, 69, (total, 5))
ss3 : pd.DataFrame = pd.DataFrame(s3, columns=["s1", "s2", "s3", "s4", "s5"])

s4 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(50, 59, (total, 5))
ss4 : pd.DataFrame = pd.DataFrame(s4, columns=["s1", "s2", "s3", "s4", "s5"])

s5 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(40, 49, (total, 5))
ss5 : pd.DataFrame = pd.DataFrame(s5, columns=["s1", "s2", "s3", "s4", "s5"])

s6 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(33, 39, (total, 5))
ss6 : pd.DataFrame = pd.DataFrame(s6, columns=["s1", "s2", "s3", "s4", "s5"])

s7 : NDArray[Shape[f"{total+5}"], Int64] = np.random.randint(0, 32, (total, 5))
ss7 : pd.DataFrame = pd.DataFrame(s7, columns=["s1", "s2", "s3", "s4", "s5"])

In [105]:
ss1

      s1  s2  s3  s4  s5
0     87  89  97  81  91
1     85  94  82  80  89
2     85  95  92  89  92
3     80  86  94  92  93
4     93  82  94  99  82
...   ..  ..  ..  ..  ..
9995  87  88  80  98  92
9996  94  81  87  97  90
9997  87  96  95  80  91
9998  80  85  82  80  83
9999  83  98  98  95  88

[10000 rows x 5 columns]

In [106]:
ss3

      s1  s2  s3  s4  s5
0     63  68  62  68  60
1     68  64  63  62  66
2     60  65  61  67  60
3     61  61  61  61  65
4     62  61  65  60  63
...   ..  ..  ..  ..  ..
9995  67  64  65  65  66
9996  68  62  65  63  67
9997  60  61  63  67  61
9998  60  60  65  62  62
9999  60  67  62  63  64

[10000 rows x 5 columns]

In [109]:
df : pd.DataFrame = pd.concat([ss1, ss2])
df

      s1  s2  s3  s4  s5
0     87  89  97  81  91
1     85  94  82  80  89
2     85  95  92  89  92
3     80  86  94  92  93
4     93  82  94  99  82
...   ..  ..  ..  ..  ..
9995  74  78  71  71  78
9996  70  75  78  73  75
9997  76  76  75  71  72
9998  74  70  71  70  76
9999  75  77  77  76  78

[20000 rows x 5 columns]

In [112]:
display = df.info()
print('================================================================')

display = df.describe()
print('================================================================')

display = df.head()
print('================================================================')

================================================================
================================================================